#  Explore and Practice Some Advanced Features of Pandas

## Pandas is the gold standard library for all things data. With functionality to load, filter, manipulate, and explore data.

In [ ]:
import pandas as pd
import numpy as np

In [10]:
emp_data_11 = pd.read_csv('C:\\RamPravesh\\BigData\\Dataset\\csv\\datasets_1632_774340_HRDataset_v13.csv')
emp_data_12 = pd.read_csv('C:\\RamPravesh\\BigData\\Dataset\\csv\\datasets_1632_774340_HRDataset_v13.csv')
emp_data_13 = pd.read_csv('C:\\RamPravesh\\BigData\\Dataset\\csv\\datasets_1632_774340_HRDataset_v13.csv')

In [43]:
emp_data_11.shape

(310, 35)

In [44]:
emp_data_12.shape

(310, 35)

In [45]:
emp_data_13.shape

(310, 35)

## Concatenate DataFrames in Pandas vertically.

In [14]:
emp_data = pd.concat([emp_data_11,emp_data_11,emp_data_11], axis=0)

In [46]:
emp_data.shape

(930, 35)

In [15]:
emp_data.head()

,Employee_Name,EmpID,MarriedID,MaritalStatusID,GenderID,EmpStatusID,DeptID,PerfScoreID,FromDiversityJobFairID,PayRate,...,Department,ManagerName,ManagerID,RecruitmentSource,PerformanceScore,EngagementSurvey,EmpSatisfaction,SpecialProjectsCount,LastPerformanceReview_Date,DaysLateLast30
0,"Brown, Mia",1103024456,1,1,0,1,1,3,1,28.50,...,1000,Brandon R. LeBlanc,1.0,Diversity Job Fair,Fully Meets,2.04,2,6,1/15/2019,0.0
1,"LaRotonda, William",1106026572,0,2,1,1,1,3,0,23.00,...,1000,Brandon R. LeBlanc,1.0,Website Banner Ads,Fully Meets,5.00,4,4,1/17/2019,0.0
2,"Steans, Tyrone",1302053333,0,0,1,1,1,3,0,29.00,...,1000,Brandon R. LeBlanc,1.0,Internet Search,Fully Meets,3.90,5,5,1/18/2019,0.0
3,"Howard, Estelle",1211050782,1,1,0,1,1,3,0,21.50,...,1000,Brandon R. LeBlanc,1.0,Pay Per Click - Google,Fully Meets,3.24,3,4,NaN,NaN
4,"Singh, Nan",1307059817,0,0,0,1,1,3,0,16.56,...,1000,Brandon R. LeBlanc,1.0,Website Banner Ads,Fully Meets,5.00,3,5,1/15/2019,0.0

In [7]:
emp_data.dtypes

Employee_Name                  object
EmpID                           int64
MarriedID                       int64
MaritalStatusID                 int64
GenderID                        int64
EmpStatusID                     int64
DeptID                          int64
PerfScoreID                     int64
FromDiversityJobFairID          int64
PayRate                       float64
Termd                           int64
PositionID                      int64
Position                       object
State                          object
Zip                             int64
DOB                            object
Sex                            object
MaritalDesc                    object
CitizenDesc                    object
HispanicLatino                 object
RaceDesc                       object
DateofHire                     object
DateofTermination              object
TermReason                     object
EmploymentStatus               object
Department                      int64
ManagerName                    object
ManagerID                     float64
RecruitmentSource              object
PerformanceScore               object
EngagementSurvey              float64
EmpSatisfaction                 int64
SpecialProjectsCount            int64
LastPerformanceReview_Date     object
DaysLateLast30                float64
dtype: object

## Horizontal concat: horizontally stack them to combine those columns / features.

In [22]:
emp_data_processing = pd.concat([emp_data[['EmpID','Employee_Name']], emp_data[['Department','PayRate']]], axis=1)

In [28]:
# Rename the Column Name
emp_data_processing.rename(columns={"Department":"DeptID"}, inplace=True)

In [42]:
emp_data_processing.shape

(930, 4)

In [29]:
emp_data_processing.head()

        EmpID         Employee_Name  DeptID  PayRate
0  1103024456            Brown, Mia    1000    28.50
1  1106026572  LaRotonda, William      1000    23.00
2  1302053333      Steans, Tyrone      1000    29.00
3  1211050782       Howard, Estelle    1000    21.50
4  1307059817           Singh, Nan     1000    16.56

In [30]:
dept_data = pd.read_csv('C:\\RamPravesh\\BigData\\Dataset\\csv\\MGF_department.csv')

In [31]:
dept_data.dtypes

Departiment_ID         int64
Name                  object
Status                object
Purpose               object
Establishment_Date    object
dtype: object

In [32]:
# Rename the Column Name
dept_data.rename(columns={"Departiment_ID":"DeptID"},inplace=True)

In [33]:
dept_data.head()

,DeptID,Name,Status,Purpose,Establishment_Date
0,1000,Admin Offices,Active,Admin Activities,6-Jun-10
1,1001,Sales,Active,Responsible for sales,7-Jun-10
2,1002,IT/IS,Active,It related works software and hardware support.,8-Jun-12
3,1003,Production,Active,Accountable for manfactureing and fullfile the...,9-Jun-10
4,1004,Executive Office,Active,Mangement related activities.,10-Jun-11

## Merging two DataFrames in Pandas is done with the merge function. 
### The left and right parameters refer to the 2 DataFrames you wish to merge, while on specifies the column to be used for the matching.

In [35]:
emp_dept_df = pd.merge(left=emp_data_processing, right=dept_data, on="DeptID")

In [41]:
emp_dept_df.shape

(930, 8)

In [38]:
emp_dept_df.head(-20)

,EmpID,Employee_Name,DeptID,PayRate,Name,Status,Purpose,Establishment_Date
0,1103024456,"Brown, Mia",1000,28.50,Admin Offices,Active,Admin Activities,6-Jun-10
1,1106026572,"LaRotonda, William",1000,23.00,Admin Offices,Active,Admin Activities,6-Jun-10
2,1302053333,"Steans, Tyrone",1000,29.00,Admin Offices,Active,Admin Activities,6-Jun-10
3,1211050782,"Howard, Estelle",1000,21.50,Admin Offices,Active,Admin Activities,6-Jun-10
4,1307059817,"Singh, Nan",1000,16.56,Admin Offices,Active,Admin Activities,6-Jun-10
...,...,...,...,...,...,...,...,...
905,1112030979,"Patronick, Luke",1005,52.25,Software Engineering,Active,Applying the SDLC agile metholodiegies.,11-Jun-13
906,1012023185,"Saada, Adell",1005,49.25,Software Engineering,Active,Applying the SDLC agile metholodiegies.,11-Jun-13
907,1201031324,"Szabo, Andrew",1005,48.00,Software Engineering,Active,Applying the SDLC agile metholodiegies.,11-Jun-13
908,1102024057,"True, Edward",1005,45.42,Software Engineering,Active,Applying the SDLC agile metholodiegies.,11-Jun-13
909,1001644719,"Sweetwater, Alex",1005,27.00,Software Engineering,Active,Applying the SDLC agile metholodiegies.,11-Jun-13

## To select the type of SQL-style join you want to perform: inner, outer, left, or right.

## Here are the different types of the JOINs in SQL:
### 1. (INNER) JOIN: Returns records that have matching values in both tables
### 2. LEFT (OUTER) JOIN: Returns all records from the left table, and the matched records from the right table 
### 3. RIGHT (OUTER) JOIN: Returns all records from the right table, and the matched records from the left table
### 4. FULL (OUTER) JOIN: Returns all records when there is a match in either left or right table

## Reshaping DataFrames: There are several ways to reshape and restructure Pandas DataFrames.

In [48]:
players_data = {'Player': ['Superman', 'Batman', 'Thanos', 'Batman', 'Thanos',
   'Superman', 'Batman', 'Thanos', 'Black Widow', 'Batman', 'Thanos', 'Superman'],
   'Year': [2000,2000,2000,2001,2001,2002,2002,2002,2003,2004,2004,2005],
   'Points':[23,43,45,65,76,34,23,78,89,76,92,87]}

In [50]:
type(players_data)

dict

In [51]:
player_df = pd.DataFrame(players_data)

In [53]:
player_df.shape

(12, 3)

In [52]:
player_df.head()

     Player  Year  Points
0  Superman  2000      23
1    Batman  2000      43
2    Thanos  2000      45
3    Batman  2001      65
4    Thanos  2001      76

## Transpose : waps a DataFrameâ€™s rows with its columns.

In [54]:
player_df_t = player_df.T

In [56]:
player_df_t.shape

(3, 12)

In [55]:
player_df_t.head()

,0,1,2,3,4,5,6,7,8,9,10,11
Player,Superman,Batman,Thanos,Batman,Thanos,Superman,Batman,Thanos,Black Widow,Batman,Thanos,Superman
Year,2000,2000,2000,2001,2001,2002,2002,2002,2003,2004,2004,2005
Points,23,43,45,65,76,34,23,78,89,76,92,87

## Groupby: Groupbyâ€™s main usage is to split up DataFrames into multiple parts based on some keys. Once the DataFrame is split up into parts, you can loop through and apply some operations on each part independently.

In [58]:
emp_dept_group = emp_dept_df.groupby("DeptID")

In [62]:
for deptID,rec in emp_dept_group:
    print("----- {} -----".format(deptID))
    print(group)
    print("")

----- 1000 -----
          EmpID      Employee_Name  DeptID  PayRate                  Name  \
900  1107027358    Andreola, Colby    1005    47.60  Software Engineering
901  1101023577   Carabbio, Judith    1005    56.00  Software Engineering
902  1203032498  Del Bosque, Keyla    1005    57.12  Software Engineering
903  1401064670     Exantus, Susan    1005    48.50  Software Engineering
904  1303054625     Martin, Sandra    1005    55.51  Software Engineering
905  1112030979    Patronick, Luke    1005    52.25  Software Engineering
906  1012023185       Saada, Adell    1005    49.25  Software Engineering
907  1201031324      Szabo, Andrew    1005    48.00  Software Engineering
908  1102024057       True, Edward    1005    45.42  Software Engineering
909  1001644719   Sweetwater, Alex    1005    27.00  Software Engineering
910  1107027358    Andreola, Colby    1005    47.60  Software Engineering
911  1101023577   Carabbio, Judith    1005    56.00  Software Engineering
912  1203032498  Del Bosque, Keyla    1005    57.12  Software Engineering
913  1401064670     Exantus, Susan    1005    48.50  Software Engineering
914  1303054625     Martin, Sandra    1005    55.51  Software Engineering
915  1112030979    Patronick, Luke    1005    52.25  Software Engineering
916  1012023185       Saada, Adell    1005    49.25  Software Engineering
917  1201031324      Szabo, Andrew    1005    48.00  Software Engineering
918  1102024057       True, Edward    1005    45.42  Software Engineering
919  1001644719   Sweetwater, Alex    1005    27.00  Software Engineering
920  1107027358    Andreola, Colby    1005    47.60  Software Engineering
921  1101023577   Carabbio, Judith    1005    56.00  Software Engineering
922  1203032498  Del Bosque, Keyla    1005    57.12  Software Engineering
923  1401064670     Exantus, Susan    1005    48.50  Software Engineering
924  1303054625     Martin, Sandra    1005    55.51  Software Engineering
925  1112030979    Patronick, Luke    1005    52.25  Software Engineering
926  1012023185       Saada, Adell    1005    49.25  Software Engineering
927  1201031324      Szabo, Andrew    1005    48.00  Software Engineering
928  1102024057       True, Edward    1005    45.42  Software Engineering
929  1001644719   Sweetwater, Alex    1005    27.00  Software Engineering

     Status                                  Purpose Establishment_Date
900  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
901  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
902  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
903  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
904  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
905  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
906  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
907  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
908  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
909  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
910  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
911  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
912  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
913  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
914  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
915  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
916  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
917  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
918  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
919  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
920  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
921  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
922  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
923  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
924  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
925  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
926  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
927  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
928  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
929  Active  Applying the SDLC agile metholodiegies.          11-Jun-13

----- 1001 -----
          EmpID      Employee_Name  DeptID  PayRate                  Name  \
900  1107027358    Andreola, Colby    1005    47.60  Software Engineering
901  1101023577   Carabbio, Judith    1005    56.00  Software Engineering
902  1203032498  Del Bosque, Keyla    1005    57.12  Software Engineering
903  1401064670     Exantus, Susan    1005    48.50  Software Engineering
904  1303054625     Martin, Sandra    1005    55.51  Software Engineering
905  1112030979    Patronick, Luke    1005    52.25  Software Engineering
906  1012023185       Saada, Adell    1005    49.25  Software Engineering
907  1201031324      Szabo, Andrew    1005    48.00  Software Engineering
908  1102024057       True, Edward    1005    45.42  Software Engineering
909  1001644719   Sweetwater, Alex    1005    27.00  Software Engineering
910  1107027358    Andreola, Colby    1005    47.60  Software Engineering
911  1101023577   Carabbio, Judith    1005    56.00  Software Engineering
912  1203032498  Del Bosque, Keyla    1005    57.12  Software Engineering
913  1401064670     Exantus, Susan    1005    48.50  Software Engineering
914  1303054625     Martin, Sandra    1005    55.51  Software Engineering
915  1112030979    Patronick, Luke    1005    52.25  Software Engineering
916  1012023185       Saada, Adell    1005    49.25  Software Engineering
917  1201031324      Szabo, Andrew    1005    48.00  Software Engineering
918  1102024057       True, Edward    1005    45.42  Software Engineering
919  1001644719   Sweetwater, Alex    1005    27.00  Software Engineering
920  1107027358    Andreola, Colby    1005    47.60  Software Engineering
921  1101023577   Carabbio, Judith    1005    56.00  Software Engineering
922  1203032498  Del Bosque, Keyla    1005    57.12  Software Engineering
923  1401064670     Exantus, Susan    1005    48.50  Software Engineering
924  1303054625     Martin, Sandra    1005    55.51  Software Engineering
925  1112030979    Patronick, Luke    1005    52.25  Software Engineering
926  1012023185       Saada, Adell    1005    49.25  Software Engineering
927  1201031324      Szabo, Andrew    1005    48.00  Software Engineering
928  1102024057       True, Edward    1005    45.42  Software Engineering
929  1001644719   Sweetwater, Alex    1005    27.00  Software Engineering

     Status                                  Purpose Establishment_Date
900  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
901  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
902  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
903  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
904  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
905  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
906  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
907  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
908  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
909  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
910  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
911  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
912  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
913  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
914  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
915  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
916  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
917  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
918  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
919  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
920  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
921  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
922  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
923  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
924  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
925  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
926  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
927  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
928  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
929  Active  Applying the SDLC agile metholodiegies.          11-Jun-13

----- 1002 -----
          EmpID      Employee_Name  DeptID  PayRate                  Name  \
900  1107027358    Andreola, Colby    1005    47.60  Software Engineering
901  1101023577   Carabbio, Judith    1005    56.00  Software Engineering
902  1203032498  Del Bosque, Keyla    1005    57.12  Software Engineering
903  1401064670     Exantus, Susan    1005    48.50  Software Engineering
904  1303054625     Martin, Sandra    1005    55.51  Software Engineering
905  1112030979    Patronick, Luke    1005    52.25  Software Engineering
906  1012023185       Saada, Adell    1005    49.25  Software Engineering
907  1201031324      Szabo, Andrew    1005    48.00  Software Engineering
908  1102024057       True, Edward    1005    45.42  Software Engineering
909  1001644719   Sweetwater, Alex    1005    27.00  Software Engineering
910  1107027358    Andreola, Colby    1005    47.60  Software Engineering
911  1101023577   Carabbio, Judith    1005    56.00  Software Engineering
912  1203032498  Del Bosque, Keyla    1005    57.12  Software Engineering
913  1401064670     Exantus, Susan    1005    48.50  Software Engineering
914  1303054625     Martin, Sandra    1005    55.51  Software Engineering
915  1112030979    Patronick, Luke    1005    52.25  Software Engineering
916  1012023185       Saada, Adell    1005    49.25  Software Engineering
917  1201031324      Szabo, Andrew    1005    48.00  Software Engineering
918  1102024057       True, Edward    1005    45.42  Software Engineering
919  1001644719   Sweetwater, Alex    1005    27.00  Software Engineering
920  1107027358    Andreola, Colby    1005    47.60  Software Engineering
921  1101023577   Carabbio, Judith    1005    56.00  Software Engineering
922  1203032498  Del Bosque, Keyla    1005    57.12  Software Engineering
923  1401064670     Exantus, Susan    1005    48.50  Software Engineering
924  1303054625     Martin, Sandra    1005    55.51  Software Engineering
925  1112030979    Patronick, Luke    1005    52.25  Software Engineering
926  1012023185       Saada, Adell    1005    49.25  Software Engineering
927  1201031324      Szabo, Andrew    1005    48.00  Software Engineering
928  1102024057       True, Edward    1005    45.42  Software Engineering
929  1001644719   Sweetwater, Alex    1005    27.00  Software Engineering

     Status                                  Purpose Establishment_Date
900  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
901  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
902  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
903  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
904  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
905  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
906  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
907  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
908  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
909  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
910  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
911  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
912  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
913  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
914  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
915  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
916  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
917  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
918  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
919  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
920  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
921  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
922  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
923  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
924  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
925  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
926  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
927  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
928  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
929  Active  Applying the SDLC agile metholodiegies.          11-Jun-13

----- 1003 -----
          EmpID      Employee_Name  DeptID  PayRate                  Name  \
900  1107027358    Andreola, Colby    1005    47.60  Software Engineering
901  1101023577   Carabbio, Judith    1005    56.00  Software Engineering
902  1203032498  Del Bosque, Keyla    1005    57.12  Software Engineering
903  1401064670     Exantus, Susan    1005    48.50  Software Engineering
904  1303054625     Martin, Sandra    1005    55.51  Software Engineering
905  1112030979    Patronick, Luke    1005    52.25  Software Engineering
906  1012023185       Saada, Adell    1005    49.25  Software Engineering
907  1201031324      Szabo, Andrew    1005    48.00  Software Engineering
908  1102024057       True, Edward    1005    45.42  Software Engineering
909  1001644719   Sweetwater, Alex    1005    27.00  Software Engineering
910  1107027358    Andreola, Colby    1005    47.60  Software Engineering
911  1101023577   Carabbio, Judith    1005    56.00  Software Engineering
912  1203032498  Del Bosque, Keyla    1005    57.12  Software Engineering
913  1401064670     Exantus, Susan    1005    48.50  Software Engineering
914  1303054625     Martin, Sandra    1005    55.51  Software Engineering
915  1112030979    Patronick, Luke    1005    52.25  Software Engineering
916  1012023185       Saada, Adell    1005    49.25  Software Engineering
917  1201031324      Szabo, Andrew    1005    48.00  Software Engineering
918  1102024057       True, Edward    1005    45.42  Software Engineering
919  1001644719   Sweetwater, Alex    1005    27.00  Software Engineering
920  1107027358    Andreola, Colby    1005    47.60  Software Engineering
921  1101023577   Carabbio, Judith    1005    56.00  Software Engineering
922  1203032498  Del Bosque, Keyla    1005    57.12  Software Engineering
923  1401064670     Exantus, Susan    1005    48.50  Software Engineering
924  1303054625     Martin, Sandra    1005    55.51  Software Engineering
925  1112030979    Patronick, Luke    1005    52.25  Software Engineering
926  1012023185       Saada, Adell    1005    49.25  Software Engineering
927  1201031324      Szabo, Andrew    1005    48.00  Software Engineering
928  1102024057       True, Edward    1005    45.42  Software Engineering
929  1001644719   Sweetwater, Alex    1005    27.00  Software Engineering

     Status                                  Purpose Establishment_Date
900  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
901  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
902  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
903  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
904  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
905  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
906  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
907  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
908  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
909  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
910  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
911  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
912  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
913  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
914  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
915  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
916  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
917  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
918  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
919  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
920  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
921  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
922  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
923  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
924  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
925  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
926  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
927  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
928  Active  Applying the SDLC agile metholodiegies.          11-Jun-13
929  Active  Applying the SDLC agile metholodiegies.          11-Jun-13

----- 1005 -----
          EmpID      Employee_Name  DeptID  PayRate                  Name  \
900  1107027358    Andreola, Colby    1005    47.60  Software Engineering
901  1101023577   Carabbio, Judith    1005    56.00  Software Engineering
902  1203032498  Del Bosque, Keyla    1005    57.12  Software Engineering
903  1401064670     Exantus, Susan    1005    48.50  Software Engineering
904  1303054625     Martin, Sandra    1005    55.51  Software Engineering
905  1112030979    Patronick, Luke    1005    52.25  Software Engineering
906  1012023185       Saada, Adell    1005    49.25  Software Engineering
907  1201031324      Szabo, Andrew    1005    48.00  Software Engineering
908  1102024057       True, Edward    1005    45.42  Software Engineering
909  1001644719   Sweetwater, Alex    1005    27.00  Software Engineering
910  1107027358    Andreola, Colby    1005    47.60  Software Engineering
911  1101023577   Carabbio, Judith    1005    56.00  Software Engineering
912  1203032498  Del Bosque, Keyla    1005    57.12  Software Engineering
913  1401064670     Exantus, Susan    1005    48.50  Software Engineering
914  1303054625     Martin, Sandra    1005    55.51  Software Engineering
915  1112030979    Patronick, Luke    1005    52.25  Software Engineering
916  1012023185       Saada, Adell    1005    49.25  Software Engineering
917  1201031324      Szabo, Andrew    1005    48.00  Software Engineering
918  1102024057       True, Edward    1005    45.42  Software Engineering
919  1001644719   Sweetwater, Alex    1005    27.00  Software Engineering
920  1107027358    Andreola, Colby    1005    47.60  Software Engineering
921  1101023577   Carabbio, Judith    1005    56.00  Software Engineering
922  1203032498  Del Bosque, Keyla    1005    57.12  Software Engineering

## Stacking: Stacking transforms the DataFrame into having a multi-level index, i.e each row has multiple sub-parts.

In [70]:
emp_dept_df.head(1).stack()

0  EmpID                       1103024456
   Employee_Name               Brown, Mia
   DeptID                            1000
   PayRate                           28.5
   Name                     Admin Offices
   Status                          Active
   Purpose               Admin Activities
   Establishment_Date            6-Jun-10
dtype: object

In [71]:
emp_dept_df_stack = emp_dept_df.stack()

In [72]:
emp_dept_df_stack

0    EmpID                                              1103024456
     Employee_Name                                      Brown, Mia
     DeptID                                                   1000
     PayRate                                                  28.5
     Name                                            Admin Offices
                                            ...
929  PayRate                                                    27
     Name                                     Software Engineering
     Status                                                 Active
     Purpose               Applying the SDLC agile metholodiegies.
     Establishment_Date                                  11-Jun-13
Length: 7440, dtype: object

## Working with time data

In [73]:
from itertools import product

In [76]:
prod = product([10,11,12],[8,9],[2018,2019])
prod

In [77]:
list_prod = list(prod)
list_prod

[(10, 8, 2018),
 (10, 8, 2019),
 (10, 9, 2018),
 (10, 9, 2019),
 (11, 8, 2018),
 (11, 8, 2019),
 (11, 9, 2018),
 (11, 9, 2019),
 (12, 8, 2018),
 (12, 8, 2019),
 (12, 9, 2018),
 (12, 9, 2019)]

In [81]:
col_names = ["Day", "Month", "Year"]
df_datetime_test = pd.DataFrame(list_prod, columns=col_names)

In [82]:
df_datetime_test['data'] = np.random.randn(len(df_datetime_test))

In [83]:
df_datetime_test.head()

   Day  Month  Year      test
0   10      8  2018  0.661546
1   10      8  2019  0.677523
2   10      9  2018 -1.040435
3   10      9  2019  1.406658
4   11      8  2018  0.592008

In [86]:
df_datetime_test.sort_values(['Year','Month'],ascending=[True,True], inplace=True)

In [87]:
df_datetime_test.head()

   Day  Month  Year      test
0   10      8  2018  0.661546
4   11      8  2018  0.592008
8   12      8  2018  1.002725
2   10      9  2018 -1.040435
6   11      9  2018 -0.062918

In [88]:
df_datetime_test.insert(loc=0, column='date', value=pd.to_datetime(df_datetime_test[col_names]))

In [89]:
df_datetime_test.head()

        date  Day  Month  Year      test
0 2018-08-10   10      8  2018  0.661546
4 2018-08-11   11      8  2018  0.592008
8 2018-08-12   12      8  2018  1.002725
2 2018-09-10   10      9  2018 -1.040435
6 2018-09-11   11      9  2018 -0.062918

In [90]:
df_datetime_test.drop(col_names, axis=1, inplace=True)

In [91]:
df_datetime_test.head()

        date      test
0 2018-08-10  0.661546
4 2018-08-11  0.592008
8 2018-08-12  1.002725
2 2018-09-10 -1.040435
6 2018-09-11 -0.062918

In [92]:
df_datetime_test = df_datetime_test.squeeze()

In [93]:
df_datetime_test.head()

        date      test
0 2018-08-10  0.661546
4 2018-08-11  0.592008
8 2018-08-12  1.002725
2 2018-09-10 -1.040435
6 2018-09-11 -0.062918

In [94]:
## C

In [95]:

foods = pd.Series(["Bread", "Rice", "Steak", "Ham", "Chicken",
                       "Apples", "Potatoes", "Mangoes", "Fish",
                       "Bread", "Rice", "Steak", "Ham", "Chicken",
                       "Apples", "Potatoes", "Mangoes", "Fish",
                       "Apples", "Potatoes", "Mangoes", "Fish",
                       "Apples", "Potatoes", "Mangoes", "Fish",
                       "Bread", "Rice", "Steak", "Ham", "Chicken",
                       "Bread", "Rice", "Steak", "Ham", "Chicken",
                       "Bread", "Rice", "Steak", "Ham", "Chicken",
                       "Apples", "Potatoes", "Mangoes", "Fish",
                       "Apples", "Potatoes", "Mangoes", "Fish",
                       "Apples", "Potatoes", "Mangoes", "Fish",
                       "Bread", "Rice", "Steak", "Ham", "Chicken",
                       "Bread", "Rice", "Steak", "Ham", "Chicken",])

groups_dict = {
    "Protein": ["Steak", "Ham", "Chicken", "Fish"],
    "Carbs": ["Bread", "Rice", "Apples", "Potatoes", "Mangoes"]
}

In [98]:
for k, v in groups_dict.items():
    print(k , "- ", v)

Protein -  ['Steak', 'Ham', 'Chicken', 'Fish']
Carbs -  ['Bread', 'Rice', 'Apples', 'Potatoes', 'Mangoes']

In [99]:
groupss = {x: k for k,v in groups_dict.items() for x in v}

In [100]:
groupss

{'Steak': 'Protein',
 'Ham': 'Protein',
 'Chicken': 'Protein',
 'Fish': 'Protein',
 'Bread': 'Carbs',
 'Rice': 'Carbs',
 'Apples': 'Carbs',
 'Potatoes': 'Carbs',
 'Mangoes': 'Carbs'}

In [102]:
mapped_food = foods.map(groupss)

In [104]:
print(list(mapped_food))

['Carbs', 'Carbs', 'Protein', 'Protein', 'Protein', 'Carbs', 'Carbs', 'Carbs', 'Protein', 'Carbs', 'Carbs', 'Protein', 'Protein', 'Protein', 'Carbs', 'Carbs', 'Carbs', 'Protein', 'Carbs', 'Carbs', 'Carbs', 'Protein', 'Carbs', 'Carbs', 'Carbs', 'Protein', 'Carbs', 'Carbs', 'Protein', 'Protein', 'Protein', 'Carbs', 'Carbs', 'Protein', 'Protein', 'Protein', 'Carbs', 'Carbs', 'Protein', 'Protein', 'Protein', 'Carbs', 'Carbs', 'Carbs', 'Protein', 'Carbs', 'Carbs', 'Carbs', 'Protein', 'Carbs', 'Carbs', 'Carbs', 'Protein', 'Carbs', 'Carbs', 'Protein', 'Protein', 'Protein', 'Carbs', 'Carbs', 'Protein', 'Protein', 'Protein']

In [108]:
food_df = pd.DataFrame({'Food': foods, 'Food_Categoery': mapped_food})

In [109]:
food_df.head()

      Food Food_Categoery
0    Bread          Carbs
1     Rice          Carbs
2    Steak        Protein
3      Ham        Protein
4  Chicken        Protein

In [118]:
# Delete Row based on index
food_df.drop(index=[0,3,5], axis=0).head()

       Food Food_Categoery
1      Rice          Carbs
2     Steak        Protein
4   Chicken        Protein
6  Potatoes          Carbs
7   Mangoes          Carbs

In [119]:
# Delete records from data frame based on condition.
food_df.drop(food_df[(food_df['Food']=='Rice')].index,axis=0).head() # inplace=True if you want to replace data frame.

      Food Food_Categoery
0    Bread          Carbs
2    Steak        Protein
3      Ham        Protein
4  Chicken        Protein
5   Apples          Carbs